In [24]:
import pandas as pd
import numpy as np

# 2.7 Coding challenge

In [ ]:
superheroes = [
    "Batman",
    'Superman',
    'Spider-Man',
    'Iron Man',
    'Captain America',
    'Wonder Woman'
]

strength_levels = (100, 120, 90, 95, 110, 120)

1. Use the list of superheroes to populate a new Series object

In [ ]:
pd.Series(superheroes)

2. Use the tuple of strength to populate a new Series object

In [ ]:
pd.Series(strength_levels)

3. Create a Series with the superheroes as index labels and the strength as values. Assign it to a heroes variable

In [ ]:
heroes = pd.Series(data=strength_levels, index=superh)
heroes

4. Extract the first two rows of the heroes series

In [ ]:
heroes.head(2)

5. Extract the last four rows of the heroes series

In [ ]:
heroes.tail(4)

6. Determine the number of unique values in your heroes Series.

In [ ]:
heroes.values

In [ ]:
heroes.nunique()

7. Calculate the average strength of the superheroes in heroes.

In [ ]:
heroes.mean()

8. Calculate the maximum and minimum strengths in heroes

In [ ]:
heroes.max()

In [ ]:
heroes.min()

9. Calculate what each superhero’s strength level would be if it doubled

In [ ]:
heroes.mul(2)

10. Convert the heroes Series to a Python dictionary

In [ ]:
dict(heroes)

# 3.6 Coding Challenge

In [ ]:
from datetime import date

Which day of thw week saw the most battles during the Revolutionary War

In [ ]:
# I just need the start date column
battles = pd.read_csv('/home/diego/Documents/Data/revolutionary_war.csv', usecols=['Start Date'], parse_dates=['Start Date']).squeeze().dropna()
battles

In [ ]:
# Now we have a Series with only the dates, let's convert the dates into the correspond day
date(2024, 6, 25).strftime('%A')

I need a function that converts each value of the series

In [ ]:
# the Series has a Datetime object, so strftime is a CLASSMETHOD we can use the current object to apply the method
def to_day(battle_date):
    return battle_date.strftime('%A')

Now I will use the apply method with the `to_day` function

In [ ]:
battle_days = battles.apply(to_day)
battle_days

Now counting the values

In [ ]:
battle_days.value_counts()

# 4.11 Coding Challenge

1. How can we import the nfl.csv file? What’s an effective way to convert the values
on its Birthday column to datetimes?

In [6]:
# the read_csv() function can parse dates and casting to the proper datatype with the parse_date parameter
pd.read_csv('/home/diego/Documents/Data/nfl.csv', 
                  parse_dates=['Birthday'])

                    Name                  Team Position   Birthday   Salary
0           Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1         Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2            Adam Butler  New England Patriots       DT 1994-04-12   645000
3            Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4              Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000
...                  ...                   ...      ...        ...      ...
1650    Bashaud Breeland    Kansas City Chiefs       CB 1992-01-30   805000
1651         Craig James   Philadelphia Eagles       CB 1996-04-29   570000
1652  Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
1653         Chuma Edoga         New York Jets       OT 1997-05-25   495000
1654        Tajae Sharpe      Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 5 columns]

2. What are the two ways we can set the DataFrame index to store the player
names?

In [13]:
# First way is from the read_csv() function with the parameter index_col
pd.read_csv('/home/diego/Documents/Data/nfl.csv', 
            parse_dates=['Birthday'],
            index_col='Name')

                                    Team Position   Birthday   Salary
Name
Tremon Smith         Philadelphia Eagles       RB 1996-07-20   570000
Shawn Williams        Cincinnati Bengals       SS 1991-05-13  3500000
Adam Butler         New England Patriots       DT 1994-04-12   645000
Derek Wolfe               Denver Broncos       DE 1990-02-24  8000000
Jake Ryan           Jacksonville Jaguars      OLB 1992-02-27  1000000
...                                  ...      ...        ...      ...
Bashaud Breeland      Kansas City Chiefs       CB 1992-01-30   805000
Craig James          Philadelphia Eagles       CB 1996-04-29   570000
Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
Chuma Edoga                New York Jets       OT 1997-05-25   495000
Tajae Sharpe            Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 4 columns]

In [10]:
# Second way is with the set_index() method
nfl = pd.read_csv('/home/diego/Documents/Data/nfl.csv', 
            parse_dates=['Birthday'])
nfl

                    Name                  Team Position   Birthday   Salary
0           Tremon Smith   Philadelphia Eagles       RB 1996-07-20   570000
1         Shawn Williams    Cincinnati Bengals       SS 1991-05-13  3500000
2            Adam Butler  New England Patriots       DT 1994-04-12   645000
3            Derek Wolfe        Denver Broncos       DE 1990-02-24  8000000
4              Jake Ryan  Jacksonville Jaguars      OLB 1992-02-27  1000000
...                  ...                   ...      ...        ...      ...
1650    Bashaud Breeland    Kansas City Chiefs       CB 1992-01-30   805000
1651         Craig James   Philadelphia Eagles       CB 1996-04-29   570000
1652  Jonotthan Harrison         New York Jets        C 1991-08-25  1500000
1653         Chuma Edoga         New York Jets       OT 1997-05-25   495000
1654        Tajae Sharpe      Tennessee Titans       WR 1994-12-23  2025000

[1655 rows x 5 columns]

In [15]:
nfl = nfl.set_index('Name')

3. How can we count the number of players per team in this data set?

In [21]:
# With the value_counts() method we can count the occurrence in the Team column
nfl.value_counts('Team')

Team
New York Jets           58
Washington Redskins     56
Kansas City Chiefs      56
San Francisco 49Ers     55
New Orleans Saints      55
Denver Broncos          54
Minnesota Vikings       54
Los Angeles Chargers    54
Dallas Cowboys          53
Chicago Bears           53
Detroit Lions           53
Seattle Seahawks        53
Buffalo Bills           53
Atlanta Falcons         53
Houston Texans          52
Philadelphia Eagles     52
Los Angeles Rams        52
New York Giants         52
Oakland Raiders         51
Arizona Cardinals       51
Cincinnati Bengals      51
Green Bay Packers       51
Jacksonville Jaguars    50
Cleveland Browns        49
Carolina Panthers       49
Miami Dolphins          49
Indianapolis Colts      49
New England Patriots    49
Baltimore Ravens        48
Pittsburgh Steelers     47
Tampa Bay Buccaneers    47
Tennessee Titans        46
Name: count, dtype: int64

In [50]:
# or also
nfl.Team.value_counts()

AttributeError: 'DataFrame' object has no attribute 'Team'

4. Who are the five highest-paid players?

In [24]:
# There are two ways, with the df.sort_values().head() or with the df.nlargest()
nfl.nlargest(5, 'Salary')

                                 Team Position   Birthday    Salary
Name
Kirk Cousins        Minnesota Vikings       QB 1988-08-19  27500000
Marcus Mariota       Tennessee Titans       QB 1993-10-30  20922000
Jameis Winston   Tampa Bay Buccaneers       QB 1994-01-06  20922000
Derek Carr            Oakland Raiders       QB 1991-03-28  19900000
Jimmy Garoppolo   San Francisco 49Ers       QB 1991-11-02  17200000

In [30]:
nfl.sort_values(by='Salary', ascending=False).head()

                                 Team Position   Birthday    Salary
Name
Kirk Cousins        Minnesota Vikings       QB 1988-08-19  27500000
Jameis Winston   Tampa Bay Buccaneers       QB 1994-01-06  20922000
Marcus Mariota       Tennessee Titans       QB 1993-10-30  20922000
Derek Carr            Oakland Raiders       QB 1991-03-28  19900000
Jimmy Garoppolo   San Francisco 49Ers       QB 1991-11-02  17200000

5. How can we sort the data set first by teams in alphabetical order and then by salary in descending order?

In [33]:
nfl.sort_values(by=['Team', 'Salary'], ascending=[True, False])

                                   Team Position   Birthday    Salary
Name
Chandler Jones        Arizona Cardinals      OLB 1990-02-27  16500000
Patrick Peterson      Arizona Cardinals       CB 1990-07-11  11000000
Larry Fitzgerald      Arizona Cardinals       WR 1983-08-31  11000000
David Johnson         Arizona Cardinals       RB 1991-12-16   5700000
Justin Pugh           Arizona Cardinals        G 1990-08-15   5000000
...                                 ...      ...        ...       ...
Ross Pierschbacher  Washington Redskins        C 1995-05-05    495000
Kelvin Harmon       Washington Redskins       WR 1996-12-15    495000
Wes Martin          Washington Redskins        G 1996-05-09    495000
Jimmy Moreland      Washington Redskins       CB 1995-08-26    495000
Jeremy Reaves       Washington Redskins       SS 1996-08-29    495000

[1655 rows x 4 columns]

6. Who is the oldest player on the New York Jets roster, and what is his birthday?

In [47]:
# We need to change the index label for the teams
nfl = nfl.reset_index().set_index('Team')
nfl

                                    Name Position   Birthday   Salary
Team
Philadelphia Eagles         Tremon Smith       RB 1996-07-20   570000
Cincinnati Bengals        Shawn Williams       SS 1991-05-13  3500000
New England Patriots         Adam Butler       DT 1994-04-12   645000
Denver Broncos               Derek Wolfe       DE 1990-02-24  8000000
Jacksonville Jaguars           Jake Ryan      OLB 1992-02-27  1000000
...                                  ...      ...        ...      ...
Kansas City Chiefs      Bashaud Breeland       CB 1992-01-30   805000
Philadelphia Eagles          Craig James       CB 1996-04-29   570000
New York Jets         Jonotthan Harrison        C 1991-08-25  1500000
New York Jets                Chuma Edoga       OT 1997-05-25   495000
Tennessee Titans            Tajae Sharpe       WR 1994-12-23  2025000

[1655 rows x 4 columns]

In [49]:
nfl.loc['New York Jets'].sort_values(by='Birthday')
# The oldest is Ryan Kalil, his birthday is 29/03/1985

                             Name Position   Birthday   Salary
Team
New York Jets          Ryan Kalil        C 1985-03-29  2400000
New York Jets      Steve McLendon       NT 1986-01-03  1500000
New York Jets    Albert McClellan      ILB 1986-06-04   805000
New York Jets    Demaryius Thomas       WR 1987-10-25  1200000
New York Jets        Bilal Powell       RB 1988-10-04   930000
New York Jets        Rontez Miles       SS 1988-11-25  1907000
New York Jets         Tom Compton        G 1989-05-10  1410000
New York Jets        Josh Bellamy       WR 1989-05-18   930000
New York Jets      Kelvin Beachum       OT 1989-06-08  8000000
New York Jets    Trumaine Johnson       CB 1990-01-01  8000000
New York Jets       Paul Worrilow      ILB 1990-05-01   805000
New York Jets         David Fales       QB 1990-10-04   805000
New York Jets      Darryl Roberts       CB 1990-11-26  1000000
New York Jets         Brent Qvale       OT 1991-03-11  1000000
New York Jets    Brandon Copeland      OLB 1991-07-02  1500000
New York Jets     Bronson Kaufusi       DE 1991-07-06   645000
New York Jets       Brian Winters        G 1991-07-10  6000000
New York Jets      Henry Anderson       DE 1991-08-03  2000000
New York Jets  Jonotthan Harrison        C 1991-08-25  1500000
New York Jets     Bennett Jackson       FS 1991-09-16   495000
New York Jets       Brandon Shell       OT 1992-02-06  2025000
New York Jets        Le'Veon Bell       RB 1992-02-18  2000000
New York Jets          Alex Lewis        G 1992-04-21  2025000
New York Jets        Daniel Brown       TE 1992-05-26   805000
New York Jets     Matthias Farley       FS 1992-07-15  3095000
New York Jets        Harvey Langi      OLB 1992-09-24   570000
New York Jets     Conor McDermott        G 1992-10-19   645000
New York Jets         Brian Poole       CB 1992-10-20  1000000
New York Jets          Sam Ficken        K 1992-12-14   495000
New York Jets       Ty Montgomery       RB 1993-01-22   805000
New York Jets      Neville Hewitt      ILB 1993-04-06  1000000
New York Jets      Robby Anderson       WR 1993-05-09  3095000
New York Jets     Jamison Crowder       WR 1993-06-17  1500000
New York Jets       Arthur Maulet       CB 1993-07-13   645000
New York Jets      Blake Countess       SS 1993-08-08  2025000
New York Jets     Nathan Shepherd       DE 1993-10-09   656000
New York Jets         Marcus Maye       FS 1994-03-08  1060822
New York Jets       James Burgess      ILB 1994-03-09   645000
New York Jets       Tarell Basham      OLB 1994-03-18   687500
New York Jets      Maurice Canady       CB 1994-05-26   720000
New York Jets     Thomas Hennessy       LS 1994-06-11   645000
New York Jets       Nate Hairston       CB 1994-06-30   645000
New York Jets      Jordan Jenkins      OLB 1994-07-01  2025000
New York Jets       Ryan Anderson        G 1994-12-30   949066
New York Jets  Folorunso Fatukasi       NT 1995-03-04   570000
New York Jets       Jordan Willis       DE 1995-05-02   754750
New York Jets        Trevon Wesco       TE 1995-09-12   495000
New York Jets      Brad Lundblade        C 1995-09-21   495000
New York Jets     Braxton Berrios       WR 1995-10-06   495000
New York Jets         Jamal Adams       SS 1995-10-17   645000
New York Jets       Vyncint Smith       WR 1996-06-09   570000
New York Jets     Blessuan Austin       CB 1996-07-19   495000
New York Jets        Frankie Luvu      OLB 1996-09-19   570000
New York Jets          Josh Adams       RB 1996-10-29   570000
New York Jets       Kyle Phillips       DE 1997-05-05   495000
New York Jets         Chuma Edoga       OT 1997-05-25   495000
New York Jets         Sam Darnold       QB 1997-06-05   570000
New York Jets    Quinnen Williams       DE 1997-12-21   495000

# 5.6 coding challenge

In [10]:
netflix = pd.read_csv("/home/diego/Documents/Data/netflix.csv")
netflix

                      title        director date_added     type
0               Alias Grace             NaN   3-Nov-17  TV Show
1            A Patch of Fog  Michael Lennox  15-Apr-17    Movie
2                  Lunatics             NaN  19-Apr-19  TV Show
3                 Uriyadi 2     Vijay Kumar   2-Aug-19    Movie
4         Shrek the Musical     Jason Moore  29-Dec-13    Movie
...                     ...             ...        ...      ...
5832            The Pursuit     John Papola   7-Aug-19    Movie
5833       Hurricane Bianca   Matt Kugelman   1-Jan-17    Movie
5834           Amar's Hands  Khaled Youssef  26-Apr-19    Movie
5835  Bill Nye: Science Guy  Jason Sussberg  25-Apr-18    Movie
5836           Age of Glory             NaN        NaN  TV Show

[5837 rows x 4 columns]

In [11]:
netflix.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5837 entries, 0 to 5836
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   title       5837 non-null   object
 1   director    3936 non-null   object
 2   date_added  5195 non-null   object
 3   type        5837 non-null   object
dtypes: object(4)
memory usage: 182.5+ KB

1. Optimize the data set for limited memory use and maximum utility.

In [21]:
# I need to change the datatype of the columns
# converting into dat
netflix = netflix.astype({'date_added': 'datetime64[ns]', 'type': 'category'})

In [25]:
netflix

                      title        director date_added     type
0               Alias Grace             NaN 2017-11-03  TV Show
1            A Patch of Fog  Michael Lennox 2017-04-15    Movie
2                  Lunatics             NaN 2019-04-19  TV Show
3                 Uriyadi 2     Vijay Kumar 2019-08-02    Movie
4         Shrek the Musical     Jason Moore 2013-12-29    Movie
...                     ...             ...        ...      ...
5832            The Pursuit     John Papola 2019-08-07    Movie
5833       Hurricane Bianca   Matt Kugelman 2017-01-01    Movie
5834           Amar's Hands  Khaled Youssef 2019-04-26    Movie
5835  Bill Nye: Science Guy  Jason Sussberg 2018-04-25    Movie
5836           Age of Glory             NaN        NaT  TV Show

[5837 rows x 4 columns]

2. Find all rows with a title of "Limitless".

In [27]:
limitless = netflix.title == 'Limitless'
netflix[limitless]

          title         director date_added     type
1559  Limitless      Neil Burger 2019-05-16    Movie
2564  Limitless              NaN 2016-07-01  TV Show
4579  Limitless  Vrinda Samartha 2019-10-01    Movie

3. Find all rows with a director of "Robert Rodriguez" and a type of "Movie".

In [28]:
rob_rod = netflix.director == 'Robert Rodriguez'
movie_type = netflix.type == 'Movie'
netflix[rob_rod & movie_type]

,title,director,date_added,type
1384,Spy Kids: All the Time in the World,Robert Rodriguez,2019-02-19,Movie
1416,Spy Kids 3: Game Over,Robert Rodriguez,2019-04-01,Movie
1460,Spy Kids 2: The Island of Lost Dreams,Robert Rodriguez,2019-03-08,Movie
2890,Sin City,Robert Rodriguez,2019-10-01,Movie
3836,Shorts,Robert Rodriguez,2019-07-01,Movie
3883,Spy Kids,Robert Rodriguez,2019-04-01,Movie

4. Find all rows with either a date_added of "2019-07-31" or a director of "Robert Altman".

In [29]:
date = netflix.date_added == '2019-07-31'
director = netflix.director == 'Robert Altman'
netflix[date | director]

                                title       director date_added     type
611                            Popeye  Robert Altman 2019-11-24    Movie
1028        The Red Sea Diving Resort    Gideon Raff 2019-07-31    Movie
1092                     Gosford Park  Robert Altman 2019-11-01    Movie
3473  Bangkok Love Stories: Innocence            NaN 2019-07-31  TV Show
5117                       Ramen Shop      Eric Khoo 2019-07-31    Movie

5. Find all rows with a director of "Orson Welles", "Aditya Kripalani", or "Sam Raimi".

In [31]:
directors = ['Orson Welles', 'Aditya Kripalani', 'Sam Raimi']
checking_directors = netflix.director.isin(directors)
netflix[checking_directors]

                           title          director date_added   type
946                 The Stranger      Orson Welles 2018-07-19  Movie
1870                    The Gift         Sam Raimi 2019-11-20  Movie
3706                Spider-Man 3         Sam Raimi 2019-11-01  Movie
4243        Tikli and Laxmi Bomb  Aditya Kripalani 2018-08-01  Movie
4475  The Other Side of the Wind      Orson Welles 2018-11-02  Movie
5115    Tottaa Pataaka Item Maal  Aditya Kripalani 2019-06-25  Movie

6. Find all rows with a date_added value between May 1, 2019 and June 1, 2019

In [32]:
dates_interest = netflix.date_added.between('2019-05-01', '2019-06-1')
netflix[dates_interest]

,title,director,date_added,type
29,Chopsticks,Sachin Yardi,2019-05-31,Movie
60,Away From Home,NaN,2019-05-08,TV Show
82,III Smoking Barrels,Sanjib Dey,2019-06-01,Movie
108,Jailbirds,NaN,2019-05-10,TV Show
124,Pegasus,Han Han,2019-05-31,Movie
...,...,...,...,...
5671,Satan & Adam,V. Scott Balcerek,2019-06-01,Movie
5675,Rim of the World,McG,2019-05-24,Movie
5677,Malibu Rescue,Savage Steve Holland,2019-05-13,Movie
5739,Mission Istaanbul: Darr Ke Aagey Jeet Hai,Apoorva Lakhia,2019-05-16,Movie
5829,The Kindness Diaries,NaN,2019-05-01,TV Show

7. Drop all rows with a NaN value in the director column.

In [41]:
netflix = netflix.dropna(subset=['director'])

In [44]:
netflix

                                   title        director date_added   type
1                         A Patch of Fog  Michael Lennox 2017-04-15  Movie
3                              Uriyadi 2     Vijay Kumar 2019-08-02  Movie
4                      Shrek the Musical     Jason Moore 2013-12-29  Movie
5                       Schubert In Love     Lars Büchel 2018-03-01  Movie
6     We Have Always Lived in the Castle   Stacie Passon 2019-09-14  Movie
...                                  ...             ...        ...    ...
5830                         Bibi & Tina     Detlev Buck 2017-04-15  Movie
5832                         The Pursuit     John Papola 2019-08-07  Movie
5833                    Hurricane Bianca   Matt Kugelman 2017-01-01  Movie
5834                        Amar's Hands  Khaled Youssef 2019-04-26  Movie
5835               Bill Nye: Science Guy  Jason Sussberg 2018-04-25  Movie

[3936 rows x 4 columns]

8. Identify the days when Netflix added only one movie to its catalog.

In [52]:
# we can use the drop_duplicates() method for this task as well
netflix.drop_duplicates(subset=['date_added'], keep=False)

,title,director,date_added,type
4,Shrek the Musical,Jason Moore,2013-12-29,Movie
12,Without Gorky,Cosima Spender,2017-05-31,Movie
30,Anjelah Johnson: Not Fancy,Jay Karas,2015-10-02,Movie
38,One Last Thing,Tim Rouhana,2019-08-25,Movie
66,Mute,Duncan Jones,2018-02-23,Movie
...,...,...,...,...
5776,Planet Earth: The Complete Collection,Alastair Fothergill,2015-04-22,TV Show
5788,Chris Brown: Welcome to My Life,Andrew Sandler,2017-10-07,Movie
5789,A Very Murray Christmas,Sofia Coppola,2015-12-04,Movie
5793,Jerry Before Seinfeld,Michael Bonfiglio,2017-09-19,Movie
5812,Little Singham in London,Prakash Satam,2019-04-22,Movie

# 6.6 coding challenge

The customers data set includes an Address column. Each address consists of a street, a city, a state, and a zip code. Your challenge is to separate these four values; assign them to new Street, City, State, and Zip columns; and then remove the Address column.

In [5]:
customers = pd.read_csv('/home/diego/Documents/Data/customers.csv')
customers

                     Name                                            Address
0           Frank Manning  6461 Quinn Groves, East Matthew, New Hampshire...
1       Elizabeth Johnson  1360 Tracey Ports Apt. 419, Kyleport, Vermont,...
2         Donald Stephens  19120 Fleming Manors, Prestonstad, Montana, 23495
3     Michael Vincent III       441 Olivia Creek, Jimmymouth, Georgia, 82991
4          Jasmine Zamora  4246 Chelsey Ford Apt. 310, Karamouth, Utah, 7...
...                   ...                                                ...
9956        Dana Browning  762 Andrew Views Apt. 254, North Paul, New Mex...
9957      Amanda Anderson  44188 Day Crest Apt. 901, Lake Marcia, Maine, ...
9958           Eric Davis  73015 Michelle Squares, Watsonville, West Virg...
9959     Taylor Hernandez       129 Keith Greens, Haleyfurt, Oklahoma, 98916
9960     Sherry Nicholson   355 Griffin Valley, Davidtown, New Mexico, 17581

[9961 rows x 2 columns]

In [15]:
split = customers.Address.str.split(', ', expand=True)

In [16]:
# adding to the dataframe
customers[['Street', 'City', 'State', 'Zip']] = split

In [18]:
# del customers['Address'] also we can use
customers.drop(columns=['Address'])

,Name,Street,City,State,Zip
0,Frank Manning,6461 Quinn Groves,East Matthew,New Hampshire,16656
1,Elizabeth Johnson,1360 Tracey Ports Apt. 419,Kyleport,Vermont,31924
2,Donald Stephens,19120 Fleming Manors,Prestonstad,Montana,23495
3,Michael Vincent III,441 Olivia Creek,Jimmymouth,Georgia,82991
4,Jasmine Zamora,4246 Chelsey Ford Apt. 310,Karamouth,Utah,76252
...,...,...,...,...,...
9956,Dana Browning,762 Andrew Views Apt. 254,North Paul,New Mexico,28889
9957,Amanda Anderson,44188 Day Crest Apt. 901,Lake Marcia,Maine,37378
9958,Eric Davis,73015 Michelle Squares,Watsonville,West Virginia,03933
9959,Taylor Hernandez,129 Keith Greens,Haleyfurt,Oklahoma,98916
9960,Sherry Nicholson,355 Griffin Valley,Davidtown,New Mexico,17581

## using regex patterns

In [25]:
customers.Street.str.replace("\d{4,}", '*', regex=True)

<>:1: SyntaxWarning: invalid escape sequence '\d'
<>:1: SyntaxWarning: invalid escape sequence '\d'
/tmp/ipykernel_40157/1190904728.py:1: SyntaxWarning: invalid escape sequence '\d'
  customers.Street.str.replace("\d{4,}", '*', regex=True)

0                  * Quinn Groves
1         * Tracey Ports Apt. 419
2                * Fleming Manors
3                441 Olivia Creek
4         * Chelsey Ford Apt. 310
                  ...
9956    762 Andrew Views Apt. 254
9957         * Day Crest Apt. 901
9958           * Michelle Squares
9959             129 Keith Greens
9960           355 Griffin Valley
Name: Street, Length: 9961, dtype: object